DELETE FROM student;
DELETE FROM course;
DELETE FROM courseplan;
DELETE FROM grade;

INSERT INTO student(sn,sno,sname,gender,enrolled,major) VALUES
    (1001,'1810650122','贾一','O','2018-8-31','信息管理与信息系统'),
    (1002,'1810650222','罗二','F','2018-8-31','信息管理与信息系统');

INSERT INTO course(cn,cno,cname) VALUES
    (1001,'10610694','信息系统开发（面向对象开发平台）'),
    (1002,'10610753','JAVA程序设计'),
    (1003,'10610482','决策方法与应用'),
    (1004,'10630652','系统工程概论'),
    (1005,'10610152','信息资源管理'),
    (1006,'11711062A1','形势与政策'),
    (1007,'10610133','管理信息系统'),
    (1008,'10610512','系统调查与分析实践'),
    (1009,'10610531','数据库实践'),
    (1010,'10610552','信息法'),	
    (1011,'10610671','企业经营模拟实践C'),
    (1012,'10610673','数据库原理及应用'),
    (1013,'10610732','web应用开发技术'),
    (1014,'10610743','管理统计学原理'),	
    (1015,'10630153','运营管理'),
    (1016,'10650222','电子商务'),
    (1017,'10720832','大学英语四级（A）'),
    (1018,'11711034','马克思主义基本原理概论'),
    (1019,'11711062A4','形势与政策A4'),
    (1020,'12200041','体育（四）');

INSERT INTO courseplan
(cou_cno,cou_cname,credit,semester,teacher,week,time,site) VALUES
    ('10610694','信息系统开发（面向对象开发平台）','4','2020-2021学年秋','吕成功','1-16周','周五7-8节','一公教B209'),
    ('10610694','信息系统开发（面向对象开发平台）','4','2020-2021学年秋','吕成功','1-16周','周二1-2节','一公教B209'),
    ('10610753','JAVA程序设计','3','2020-2021学年秋','李威威','4-18周双周','周三3-4节','一公教B309'),
    ('10610753','JAVA程序设计','3','2020-2021学年秋','李威威','3-18周','周四3-4节','一公教B309'),
    ('10610482','决策方法与应用','2','2020-2021学年秋','井彩霞','3-18周','周一3-4节','一公教B305'),
    ('10630652','系统工程概论','2','2020-2021学年秋','吴翠花','3-18周','周五3-4节','一公教B305'),
    ('10610152','信息资源管理','2','2020-2021学年秋','李莹,江婷婷','3-18周','周三5-6节','一公教A111'),
    ('11711062A1','形势与政策','0.25','2020-2021学年秋','张冠','13-16周','周二7-8节','一公教A219');

INSERT INTO grade(stu_sno_gra,stu_sname_gra,cou_cno_gra,cou_cname_gra,cou_credit_gra,grade) VALUES
    ('1810650222','罗二','10610133','管理信息系统','3','60'),
    ('1810650222','罗二','10610512','系统调查与分析实践','1','60'),
    ('1810650222','罗二','10610531','数据库实践','0.5','60'),
    ('1810650222','罗二','10610552','信息法','2','60'),
    ('1810650222','罗二','10610671','企业经营模拟实践C','0.5','60'),
    ('1810650222','罗二','10610673','数据库原理及应用','3','60'),
    ('1810650222','罗二','10610732','web应用开发技术','2','60'),
    ('1810650222','罗二','10610743','管理统计学原理','3','60'),
    ('1810650222','罗二','10630153','运营管理','3','60'),
    ('1810650222','罗二','10650222','电子商务','2','60'),
    ('1810650222','罗二','10720832','大学英语四级（A）','2','60'),
    ('1810650222','罗二','11711034','马克思主义基本原理概论','3.5','60'),
    ('1810650222','罗二','12200041','体育（四）','1','60');
    